Autodesk.Revit.DB.ProfilePlaneLocation
Indicates the location of Sweep profile plane on the path curve.
Remarks: Use this enum in the NewSweep() method to create generic forms.

Autodesk.Revit.DB.ProfilePlaneLocation.End
Indicates the profile plane located at the End of the path curve.

Autodesk.Revit.DB.ProfilePlaneLocation.MidPoint
Indicates the profile plane located at the Middle point of the path curve.

Autodesk.Revit.DB.ProfilePlaneLocation.Start
Indicates the profile plane located at the start of the path curve.